ItemEvents.tooltip(event=>{
    event.add('gtceu:nh3_factory',["§7编程电路§f1号§7为快速制取氨，§f不回收利用§7未反应的原料",
        "§7编程电路§f2-10号§7为回收原料制取氨，§f循环利用§7原料§f2-10次",
        "§a白铜§7线圈会使效率降低§f25%§7，§a坎塔尔合金§7后的每个线圈都会增加§f50%§7的速度。",
        "可以使用并行控制仓","具有无损超频"])
    event.add('gtceu:bayer',[
        "§7拜耳法制取(氢)氧化铝的机器，同时会产出副产拜耳母液，含有少量的镓",
        "§7编程电路§f1号§7为制取氢氧化铝，§7编程电路§f2号§7为制取氧化铝",
        "§a白铜§7线圈会使效率降低§f25%§7，§a坎塔尔合金§7后的每个线圈都会增加§f50%§7的速度。",
        "可以使用并行控制仓",
    "具有无损超频"])
    event.add('gtceu:h2so4_factory',[
        "§7编程电路§f1号§7为用硫制取硫酸，用水吸收三氧化硫",
        "§7编程电路§f2号§7为用硫制取硫酸，用硫酸吸收三氧化硫",
        "§7编程电路§f3号§7为用二氧化硫制取硫酸，用硫酸吸收三氧化硫",
        "§a白铜§7线圈会使效率降低§f25%§7，§a坎塔尔合金§7后的每个线圈都会增加§f50%§7的速度。",
        "可以使用并行控制仓",
    "具有无损超频"])
    event.add('gtceu:hno3_factory',[
        "§7编程电路§f1号§7为快速制取硝酸，§f不回收利用§7未反应的原料",
        "§7编程电路§f2-3号§7为回收原料制取氨，§f循环利用§7原料§f2-3次",
        "§7编程电路§f11号§7为制取二氧化氮",
        "§a白铜§7线圈会使效率降低§f25%§7，§a坎塔尔合金§7后的每个线圈都会W增加§f50%§7的速度。",
        "可以使用并行控制仓",
    "具有无损超频"])
    event.add('gtceu:plastic_factory',[
        "聚合塑料的机器",
        "§a白铜§7线圈会使效率降低§f25%§7，§a坎塔尔合金§7后的每个线圈都会增加§f50%§7的速度。",
        "可以使用并行控制仓",
    "具有无损超频"])
    event.add('gtceu:hv_yasuo',[
        "可用配方类型：卷板机，压缩机，压模器，流体固化器，锻造锤，冲压机床，车床，线材轧机","机器配方时间固定缩短为0.5x，能耗固定降低为0.8x",
       "可以使用并行控制仓"
    ])
    event.add('gtceu:hv_fenli',[
        "可用配方类型：离心机，切割机，蒸馏室，电解机，电磁选矿机，筛选机，热力离心机，研磨机","机器配方时间固定缩短为0.5x，能耗固定降低为0.8x",
       "可以使用并行控制仓"
       // "可以使用且只能使用4x 并行控制仓"
    ])
    event.add('gtceu:hv_jiagong',[
        "可用配方类型：组装机，酿造室，装罐机，化学浸洗机，发酵槽，搅拌机，洗矿厂，打包机，两极磁化机，激光蚀刻机，电路组装机","机器配方时间固定缩短为0.5x，能耗固定降低为0.8x",
       "可以使用并行控制仓"
       // "可以使用且只能使用4x 并行控制仓"
    ])
    event.add('gtceu:hv_jiare',[
        "可用配方类型：电炉，合金炉，电弧炉，高压釜，提取机，流体加热器","机器配方时间固定缩短为0.5x，能耗固定降低为0.8x",
       "可以使用并行控制仓"
       // "可以使用且只能使用4x 并行控制仓"
    ])
    event.add('gtceu:mv_generator',[
        "§6编程电路§f1号§6为全功率发电(16A MV)但需额外提供氧气",
        "§6此时使用时至少需要§f8个§6MV动力仓；",
        "§7编程电路§f2号§7为低功率发电(4A MV)无需额外提供氧气",
        "§7此时使用时至少需要§f2个§7MV动力仓。",
        "使用无线动力仓，则两种模式都仅需一个16A MV无线动力仓"])
    event.add('gtceu:hv_generator',[
        "一个烧开水的机器？",
        "线圈是用作电磁铁的，想不到吧！",
        "§6编程电路§f1号§6为全功率发电(64A HV)，使用天然气燃烧",
        "§7编程电路§f2号§7为低功率发电(16A HV)，使用无烟煤燃烧",
    ])
    event.add('gtceu:uev_new_parallel_hatch',[
        "允许同时处理1024个配方"
    ])
    event.add('gtceu:uiv_new_parallel_hatch',[
        "允许同时处理4096个配方"
    ])
    event.add('gtceu:uxv_new_parallel_hatch',[
        "允许同时处理16384个配方"
    ])
})